---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.CutLinePatternId
source: html/b27703e8-6f6e-8def-d5e9-f508f091a068.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.CutLinePatternId Property

ElementId of the cut surface line pattern.

## Syntax (C#)
```csharp
public ElementId CutLinePatternId { get; }
```